{"speakers":[{"last":"Ammerman","first":"Matt","image":"2570.jpg","twitter":"mattammerman","linkedin":"mattammerman","bio":"Matt brings over a decade of customer implementation and support experience to his role as Apprenda’s VP of Client Services. Apprenda’s client services team drives education, implementation, and customization of Apprenda for customers around the world through the world’s first private cloud adoption program: Apprenda CloudRISE. He’s a regular speaker at various conferences and Code Camps around the U.S and teaches INF496 Cloud Computing at SUNY Albany. Matt was awarded the Business Review’s 40 Under 40 in 2010."},{"last":"Bedra","first":"Aaron","image":"2584.jpg","twitter":"abedra","linkedin":"abedra","bio":"Aaron is a Principal Consultant at Cigital where he drives secure programming practices. Aaron is the creator of Repsheet, an open source framework for web application attack prevention. He is a contributor to Brakeman, a Ruby on Rails static analysis tool and a co-author of Programming Clojure."},{"last":"Bell","first":"Peter","image":"1294.jpg","twitter":"peterbell","linkedin":"","bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\n\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag."},{"first":"Edward","last":"Burns","image":"2217.jpg","twitter":"edburns","google":"edburns","linkedin":"edburns","bio":"Ed Burns is currently a consulting member of the technical staff at Oracle America Inc., where he leads a team of Web experts from across the industry in developing JavaServer Faces Technology through the Java Community Process and in open source. He is the author of four books for McGraw-Hill: Secrets of the Rock Star Programmers (2008), JavaServer Faces: The Complete Reference (co-authored with Chris Schalk, 2006), JavaServer Faces 2.0: The Complete Reference (co-authored with Chris Schalk and Neil Griffin, 2009), and Hudson Continuous Integration in Practice (co-authored with Winston Prakash, 2013).\n\nBefore working on JavaServer Faces, Ed worked on a wide variety of client and server-side Web technologies since 1994, including NCSA Mosaic for X, Mozilla, the Sun Java Plug-in, Jakarta Tomcat, the Cosmo Create HTML authoring tool, and the Web transport layer in the Irix operating system from Silicon Graphics.\n\nEd is a frequent speaker at international industry conferences, having presented many times at Oracle’s JavaOne conference, given keynote addresses at the W-JAX and JAX conferences in Germany, the Globalcode Developer’s Conference in Sao Paulo, Brazil, the JSF Days and CONFESS Conferences in Vienna, Austria, the DOAG Conference in Nuremberg, Germany, and also has spoken at numerous Java User Group meetings and the No Fluff Just Stuff Java Symposium."},{"first":"Mariana","last":"Bravo","image":"2551.jpg","twitter":"marivb","bio":"Mariana Bravo studies and uses Agile since 2006, having interest in themes such as: TDD, refactoring, software craftsmanship, and Lean Software Development. She was a co-founder and organizer of the Coding Dojo @ SP, as well as an organizer for Agile Brazil and Encontro Ágil. Since 2011 she is a developer and a consultant at ThoughtWorks, helping teams to deliver high quality software using Agile.\n\nMariana Bravo is co-presenting with Danilo Sato."},{"first":"Mike","last":"Cantelon","image":"2470.jpg","twitter":"mcantelon","bio":"Mike Cantelon is a Vancouver, Canada, based web developer who works on open source archival systems for Artefactual Systems. Mike is co-author of Manning Publications’ “Node.js in Action”."},{"first":"Jason","last":"Chambers","image":"1013.jpg","twitter":"jasondchambers","linkedin":"jasondchambers","bio":""},{"first":"Stephen","last":"Chin","image":"2172.jpg","twitter":"steveonjava","google":"102473624010115291999","linkedin":"steveonjava","bio":"Stephen Chin is a Java Ambassador at Oracle specializing in embedded and UI technology, co-author of the Pro JavaFX Platform 2 title, and the JavaOne Content Chair. He has been featured at Java conferences around the world including Devoxx, JFokus, OSCON, JFall, GeeCON, JustJava, and JavaOne, where he thrice received a Rock Star Award. "},{"first":"James","last":"Chittenden","image":"2182.jpg","twitter":"okayjames","linkedin":"chittenden","google":"102504295202090613399","bio":"James Chittenden is a solutions engineer on the Google Cloud Platform team. James comes from a strong development background, focusing on a broad set of areas including open source, Microsoft stack as well as wide variety of UX capabilities. He has over 15 years of deep IT enterprise experience, including a strong focus on Business Intelligence, UX as well as an evangelist promoting developer technologies."},{"first":"Jack","last":"Coleman","image":"2295.jpg","twitter":"hpccsystems","bio":"Jack Coleman is an Architect for LexisNexis Risk Solutions where he is involved in a variety of projects across the company’s insurance businesses. He has been building and integrating server side systems since Java 1.0 and holds several certifications including the Oracle Certified Enterprise Architect. Though biased to Java, Jack enjoys working with a variety of languages including ECL, Python, C#, C++, Go, and Lisp."},{"first":"Grant","last":"Davies","image":"2214.jpg","twitter":"bluetubei","bio":"As the president and CEO of Bluetube, I lead a group of digital experience pioneers who seamlessly blend the technical and creative to meet our client’s needs. I help my clients navigate, leverage and bend the digital space to meet their needs so they can better communicate their message and reach their customers. And I love doing it.\n\nI have a solid background in the IT Space, where I spent two decades working as a developer and an architect for fortune 500’s before moving into a leadership role an founding Bluetube.\n\nI’m fueled by an entrepreneurial spirit and a desire to create and innovate, which is why I started Bluetube in 1999. I’m lucky to be surrounded by like-minded designers, developers, programmers and strategists. Whether it’s via mobile, tablet, desktop or social media outlets, working with CNN.com, Kimberly Clark, or the new startup– we work together to craft digital solutions and strategies for our clients.\n\nI’ve lived in Atlanta since 1996 and became a U.S. citizen in 2010, but I’m originally from Manchester, England."},{"first":"Ovidiu","last":"Dimulescu","image":"2482.jpg","twitter":"odimulescu","linkedin":"odimulescu","bio":"Ovidiu is a Cloud Engineer at Oracle. A full stack developer, comfortable at any level in an application stack he enjoys fun challenges and solid engineering. He is the founder and organizer of Jacksonville Mobile User Group. Ovidiu enjoys sharing the knowledge and learning in the process by speaking at various developers events.\n\nHis current interest is in cloud computing, analytics and systems thinking. "},{"first":"Tom","last":"Elrod","image":"2567.jpg","twitter":"telrodus","bio":"Entrepreneur and technologist with expertise is in project rescue, enterprise software, systems integration, infrastructure, and Open Source Software."},{"first":"Yakov","last":"Fain","image":"1070.jpg","twitter":"yfain","google":"116033097136007429330","linkedin":"yakov-fain","bio":"Yakov Fain is Managing Director at a software boutique Farata Systems. He authored several technical books and lots of articles on software development. His book «Java Programming. 24-Hour Trainer» was published by Wrox in 2011. Yakov is Java Champion (https://java-champions.java.net/). Yakov leads Princeton Java Users Group. This year he’s a co-authored O’Reilly book “Enterprise Web Development”."},{"first":"Stephen","last":"Feather","image":"2547.jpg","twitter":"StephenFeather","bio":"Stephen Feather founded Feather Direct in 2009, recognizing a need for quality mobile app development, reputation management, and SEO services for smaller organizations. He worked directly with communications companies such as Netscape, Microsoft, and Oracle in the early days of the Internet. In 1996 he authored JavaScript by Example, one of the first publications on the then-new scripting language. He volunteers time to assist and train a new generation of app developers through online forums and local user groups."},{"first":"Neal","last":"Ford","image":"1006.jpg","twitter":"neal4d","bio":"Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 6 books spanning a variety of technologies, including the most recent The Productive Programmer. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com."},{"first":"Brian","last":"Fox","image":"2390.jpg","twitter":"brian_fox","linkedin":"brianefox","bio":"Brian is VP of Product Management at Sonatype. He has extensive open source experience as a member of the Apache Software Foundation and former Chair of the Apache Maven project. Brian was a direct contributor to the Maven ecosystem, including the maven-dependency-plugin and maven-enforcer-plugin. He has over 15 years of experience driving the vision behind, as well as developing and leading the development of software for organizations ranging from startups to large enterprises. Brian is a frequent speaker at national and regional events including JavaOne, and other development related conferences. He holds a BS in CS from Daniel Webster College."},{"first":"Cory","last":"Foy","image":"2517.jpg","twitter":"cory_foy","bio":"Cory has a long history with agile methods, implementing XP, Lean and Agile practices at a wide variety of companies, from startups to regulated industries. In addition, he served as the Global Community Liaison for the Scrum Alliance. He currently runs a software and consulting company, providing coaching, training and consulting for companies around the globe. He also serves as CTO of Pretty Kool Apps, a startup focused on educational technology for therapists and teachers working with children. Cory can be found on Twitter at @cory_foy, and on his blog at http://blog.coryfoy.com."}]}